---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IExternalCommand Members
IExternalCommand Interface Methods See Also Send Feedback
---

The IExternalCommand type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Execute | Overload this method to implement and external command within Revit. |

# See Also

IExternalCommand Interface

Autodesk.Revit.UI Namespace